FemDesign.Loads.LoadGroupTable
load_group_table

FemDesign.Loads.LoadGroupTable.#ctor
Parameterless constructor for serialization.

FemDesign.Loads.LoadGroupTable.#ctor(System.Collections.Generic.List{FemDesign.Loads.ModelGeneralLoadGroup})
Internal constructor. Used for GH components and Dynamo nodes.

FemDesign.Loads.LoadGroupTable.AddGeneralLoadGroup(FemDesign.Loads.ModelGeneralLoadGroup)
Add GeneralLoadGroup to LoadGroupTable.

FemDesign.Loads.LoadGroupTable.LoadGroupInLoadGroupTable(FemDesign.Loads.ModelGeneralLoadGroup)
Check if GeneralLoadGroup is in LoadGroupTable.

FemDesign.Loads.LoadGroupTable.EntityCreated
Invoke when an instance is created.